# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 15  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  
  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BottleNeck, 2, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BottleNeck, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BottleNeck, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BottleNeck, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, wfc, [256]]  # 8
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, wfc, [256]] # 10

  - [-1, 1, WaveletUnPool, []] # 11
  - [6, 1, wfc, [256]] # 12
  - [[-2, -1], 1, Concat, [1]] # 13
  - [-1, 3, RepC3, [256]]  # 14
  - [-1, 1, wfc, [256]]  # 15

  - [-1, 1, WaveletUnPool, []] # 16
  - [5, 1, wfc, [256]]  # 17
  - [[-2, -1], 1, Concat, [1]]  # 18
  - [-1, 3, RepC3, [256]]    # 19
  - [-1, 1, wfc, [256]]  # 20

  - [-1, 1, WaveletUnPool, [ ]]   # 21
  - [4, 1, wfc, [256]]  # 22
  - [[-2, -1], 1, Concat, [1]]    # 23
  - [-1, 3, RepC3, [256]]    # 24

  - [-1, 1, wtd, []]   # 25
  - [[-1, 20], 1, Concat, [1]]  # 26
  - [-1, 3, RepC3, [256]] # 27

  - [-1, 1, wtd, []]   # 28
  - [[-1, 15], 1, Concat, [1]]  # 29
  - [-1, 3, RepC3, [256]]    # 30

  - [-1, 1, wtd, []]   # 31
  - [[-1, 10], 1, Concat, [1]]  # 32
  - [-1, 3, RepC3, [256]]    # 33

  - [[24, 27, 30, 33], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect



